Repository: Omerialis/wp-client-onboarding
Catalog: languages/wp-client-onboarding-*.po
Languages: fr_fr

source: Embedded user manual for client onboarding
fr_fr: Manuel utilisateur intégré pour l'onboarding client

source: User Manual
fr_fr: Manuel d'utilisation

source: View
fr_fr: Consulter

source: Import Sections
fr_fr: Importer les sections

source: Import
fr_fr: Importer

source: Please select a .json file.
fr_fr: Veuillez sélectionner un fichier .json.

source: Please select a file to import.
fr_fr: Veuillez sélectionner un fichier à importer.

source: Manual Sections
fr_fr: Sections du manuel

source: Client manual sections
fr_fr: Sections du manuel client

source: Manual Section
fr_fr: Section du manuel

source: All Sections
fr_fr: Toutes les sections

source: Add New Section
fr_fr: Ajouter une nouvelle section

source: Add New Manual Section
fr_fr: Ajouter une nouvelle section du manuel

source: Edit Section
fr_fr: Modifier la section

source: New Section
fr_fr: Nouvelle section

source: View Section
fr_fr: Afficher la section

source: Search Sections
fr_fr: Rechercher les sections

source: No sections found
fr_fr: Aucune section trouvée

source: No sections found in Trash
fr_fr: Aucune section trouvée dans la corbeille

source: Order
fr_fr: Ordre

source: Nonce verification failed.
fr_fr: La vérification du nonce a échoué.

source: Insufficient permissions.
fr_fr: Permissions insuffisantes.

source: No file uploaded.
fr_fr: Aucun fichier envoyé.

source: File must have a .json extension.
fr_fr: Le fichier doit avoir une extension .json.

source: Invalid file type. Please upload a JSON file.
fr_fr: Type de fichier invalide. Veuillez envoyer un fichier JSON.

source: Unable to read uploaded file.
fr_fr: Impossible de lire le fichier envoyé.

source: Failed to read file contents.
fr_fr: Échec de la lecture du contenu du fichier.

source: Invalid JSON format:
fr_fr: Format JSON invalide :

source: JSON must contain an array of objects.
fr_fr: Le JSON doit contenir un tableau d'objets.

source: Entry %d is not an object.
fr_fr: L'entrée %d n'est pas un objet.

source: Entry %d missing required field "title".
fr_fr: L'entrée %d n'a pas le champ requis « title ».

source: Entry %d missing required field "content".
fr_fr: L'entrée %d n'a pas le champ requis « content ».

source: Entry %d has invalid "order" field (must be integer).
fr_fr: L'entrée %d a un champ « order » invalide (doit être un entier).

source: Entry %d failed to import: %s
fr_fr: Échec de l'import de l'entrée %d : %s

source: Successfully imported %d section(s).
fr_fr: %d section(s) importée(s) avec succès.

source: Some entries had errors:
fr_fr: Certaines entrées comportent des erreurs :

source: No entries were imported.
fr_fr: Aucune entrée n'a été importée.

source: Errors:
fr_fr: Erreurs :

source: Import Manual Sections
fr_fr: Importer les sections du manuel

source: Upload JSON File
fr_fr: Envoyer un fichier JSON

source: Upload a JSON file containing manual sections to import them into the system.
fr_fr: Envoyez un fichier JSON contenant les sections du manuel pour les importer dans le système.

source: JSON File
fr_fr: Fichier JSON

source: Select a .json file to import.
fr_fr: Sélectionnez un fichier .json à importer.

source: Selected file:
fr_fr: Fichier sélectionné :

source: JSON Format
fr_fr: Format JSON

source: Your JSON file should be an array of objects with the following structure:
fr_fr: Votre fichier JSON doit être un tableau d'objets avec la structure suivante :

source: Field Descriptions
fr_fr: Description des champs

source: (required, string) - Section title
fr_fr: (requis, chaîne) - Titre de la section

source: (required, string) - Section content (HTML allowed)
fr_fr: (requis, chaîne) - Contenu de la section (HTML autorisé)

source: (optional, integer) - Section display order
fr_fr: (optionnel, entier) - Ordre d'affichage de la section

source: Importing...
fr_fr: Importation en cours...

source: No sections found.
fr_fr: Aucune section trouvée.

source: Section not found.
fr_fr: Section introuvable.

source: Back to manual
fr_fr: Retour au manuel
